wagiminator/SAMD-Development-Boards/ArduinoCore-samd/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# Modified 2021 by Stefan Wagner, https://github.com/wagiminator

menu.cpu=Microcontroller
menu.clock=Clock Source
menu.usb=USB Config
menu.serial=Serial Config
menu.bootloader=Bootloader
menu.timer=Timer PWM Frequency
menu.float=Floating Point
menu.config=Build Options


# =================================================================
# SAMD11C14A DevBoard
# =================================================================
d11c14a.name=SAMD11C DevBoard
d11c14a.vid.0=0x16D0
d11c14a.pid.0=0x0557
d11c14a.vid.1=0x16D0
d11c14a.pid.1=0x0856
d11c14a.vid.2=0x16D0
d11c14a.pid.2=0x0B41
d11c14a.vid.3=0x16D0
d11c14a.pid.3=0x0B40
d11c14a.vid.4=0x16D0
d11c14a.pid.4=0x0A0C
d11c14a.vid.5=0x16D0
d11c14a.pid.5=0x0856
d11c14a.build.mcu=cortex-m0plus
d11c14a.build.mathlib=arm_cortexM0l_math
d11c14a.build.f_cpu=48000000L
d11c14a.build.usb_product="SAMD11C DevBoard"
d11c14a.build.usb_manufacturer="Wagiminator"
d11c14a.build.board=SAMD_ZERO
d11c14a.build.core=arduino
d11c14a.build.variant=SAMD11C
d11c14a.build.variant_system_lib=
d11c14a.build.vid=0x16D0
d11c14a.upload.protocol=sam-ba
d11c14a.bootloader.tool=arduino:openocd

d11c14a.menu.float.default=Print & String use auto-promoted doubles only
d11c14a.menu.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
d11c14a.menu.float.print=Print uses separate singles and doubles
d11c14a.menu.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
d11c14a.menu.float.string=String uses separate singles and doubles
d11c14a.menu.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
d11c14a.menu.float.both=Print & String use separate singles and doubles
d11c14a.menu.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES

d11c14a.menu.config.disabled=config.h disabled
d11c14a.menu.config.disabled.build.buildconfig=CONFIG_H_DISABLED
d11c14a.menu.config.enabled=config.h enabled (mostly code size reductions)
d11c14a.menu.config.enabled.build.buildconfig=CONFIG_H_ENABLED

d11c14a.menu.clock.internal_usb=Internal USB Calibrated Oscillator
d11c14a.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
d11c14a.menu.clock.internal=Internal Oscillator
d11c14a.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
# d11c14a.menu.clock.crystal_32k=32KHz Crystal
# d11c14a.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
# d11c14a.menu.clock.crystal_hs=High Speed Crystal
# d11c14a.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL

d11c14a.menu.timer.timer_732Hz=732.4Hz (16-bit)
d11c14a.menu.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
d11c14a.menu.timer.timer_366Hz=366.2Hz (16-bit)
d11c14a.menu.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
d11c14a.menu.timer.timer_244Hz=244.1Hz (16-bit)
d11c14a.menu.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
d11c14a.menu.timer.timer_183Hz=183.1Hz (16-bit)
d11c14a.menu.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
d11c14a.menu.timer.timer_146Hz=146.5Hz (16-bit)
d11c14a.menu.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
d11c14a.menu.timer.timer_122Hz=122.1Hz (16-bit)
d11c14a.menu.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
d11c14a.menu.timer.timer_105Hz=104.6Hz (16-bit)
d11c14a.menu.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
d11c14a.menu.timer.timer_81Hz=81.38Hz (16-bit)
d11c14a.menu.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
d11c14a.menu.timer.timer_61Hz=61.04Hz (16-bit)
d11c14a.menu.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
d11c14a.menu.timer.timer_31Hz=30.52Hz (16-bit)
d11c14a.menu.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
d11c14a.menu.timer.timer_187500Hz=187500Hz (8-bit)
d11c14a.menu.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
d11c14a.menu.timer.timer_93750Hz=93750Hz (8-bit)
d11c14a.menu.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
d11c14a.menu.timer.timer_62500Hz=62500Hz (8-bit)
d11c14a.menu.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
d11c14a.menu.timer.timer_37500Hz=37500Hz (8-bit)
d11c14a.menu.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
d11c14a.menu.timer.timer_20833Hz=20833Hz (8-bit)
d11c14a.menu.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
d11c14a.menu.timer.timer_12500Hz=12500Hz (8-bit)
d11c14a.menu.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
d11c14a.menu.timer.timer_7500Hz=7500Hz (8-bit)
d11c14a.menu.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
d11c14a.menu.timer.timer_4166Hz=4166Hz (8-bit)
d11c14a.menu.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
d11c14a.menu.timer.timer_2930Hz=2930Hz (8-bit)
d11c14a.menu.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
d11c14a.menu.timer.timer_1465Hz=1465Hz (8-bit)
d11c14a.menu.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz

d11c14a.build.extra_flags=-D__SAMD11C14A__ {build.usb_flags} -DARM_MATH_CM0PLUS
d11c14a.build.ldscript=flash_16KB.ld
d11c14a.build.openocdscript=openocd_scripts/SAMD11C14A.cfg
d11c14a.bootloader.file=sam_ba_SAMD11C_DevBoard_SAMD11C14A.bin

d11c14a.menu.bootloader.4kb=4KB Bootloader
d11c14a.menu.bootloader.4kb.build.bootloader_size=__4KB_BOOTLOADER__
d11c14a.menu.bootloader.4kb.build.ldscript_path=linker_scripts/gcc/4KB_Bootloader
d11c14a.menu.bootloader.4kb.upload.tool=SAMD_DevBoards:bossac
d11c14a.menu.bootloader.4kb.upload.use_1200bps_touch=true
d11c14a.menu.bootloader.4kb.upload.wait_for_upload_port=true
d11c14a.menu.bootloader.4kb.upload.native_usb=true
d11c14a.menu.bootloader.4kb.upload.maximum_size=12288

