wagiminator/SAMD-Development-Boards/ArduinoCore-samd/boards.txt
d11c14a.menu.bootloader.0kb=No Bootloader
d11c14a.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
d11c14a.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
d11c14a.menu.bootloader.0kb.upload.tool=arduino:openocd
d11c14a.menu.bootloader.0kb.upload.use_1200bps_touch=false
d11c14a.menu.bootloader.0kb.upload.wait_for_upload_port=false
d11c14a.menu.bootloader.0kb.upload.native_usb=false
d11c14a.menu.bootloader.0kb.upload.maximum_size=16384

d11c14a.menu.serial.one_uart=1x UART, 1x WIRE, 0x SPI
d11c14a.menu.serial.one_uart.build.serialcom_uart=ONE_UART
d11c14a.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
d11c14a.menu.serial.one_uart.build.serialcom_spi=NO_SPI
d11c14a.menu.serial.two_uart=2x UART, 0x WIRE, 0x SPI
d11c14a.menu.serial.two_uart.build.serialcom_uart=TWO_UART
d11c14a.menu.serial.two_uart.build.serialcom_wire=NO_WIRE
d11c14a.menu.serial.two_uart.build.serialcom_spi=NO_SPI
d11c14a.menu.serial.one_uart_no_wire_one_spi=1x UART, 0x WIRE, 1x SPI
d11c14a.menu.serial.one_uart_no_wire_one_spi.build.serialcom_uart=ONE_UART
d11c14a.menu.serial.one_uart_no_wire_one_spi.build.serialcom_wire=NO_WIRE
d11c14a.menu.serial.one_uart_no_wire_one_spi.build.serialcom_spi=ONE_SPI
d11c14a.menu.serial.no_uart=0x UART, 1x WIRE, 1x SPI
d11c14a.menu.serial.no_uart.build.serialcom_uart=NO_UART
d11c14a.menu.serial.no_uart.build.serialcom_wire=ONE_WIRE
d11c14a.menu.serial.no_uart.build.serialcom_spi=ONE_SPI

d11c14a.menu.usb.cdc=CDC only
d11c14a.menu.usb.cdc.build.usbcom=CDC_ONLY
d11c14a.menu.usb.cdc.build.pid=0x0557
d11c14a.menu.usb.hid=HID only
d11c14a.menu.usb.hid.build.usbcom=HID_ONLY
d11c14a.menu.usb.hid.build.pid=0x0B40
d11c14a.menu.usb.cdc_hid=CDC & HID
d11c14a.menu.usb.cdc_hid.build.usbcom=CDC_HID
d11c14a.menu.usb.cdc_hid.build.pid=0x0856
d11c14a.menu.usb.withcdc=with CDC
d11c14a.menu.usb.withcdc.build.usbcom=WITH_CDC
d11c14a.menu.usb.withcdc.build.pid=0x0B41
d11c14a.menu.usb.nocdc=without CDC
d11c14a.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
d11c14a.menu.usb.nocdc.build.pid=0x0A0C
d11c14a.menu.usb.none=USB disabled
d11c14a.menu.usb.none.build.usbcom=USB_DISABLED
d11c14a.menu.usb.none.build.pid=0x0856


# =================================================================
# SAMD11D DevBoard
# =================================================================
d11d14as.name=SAMD11D DevBoard
d11d14as.vid.0=0x16D0
d11d14as.pid.0=0x0557
d11d14as.vid.1=0x16D0
d11d14as.pid.1=0x0856
d11d14as.vid.2=0x16D0
d11d14as.pid.2=0x0B41
d11d14as.vid.3=0x16D0
d11d14as.pid.3=0x0B40
d11d14as.vid.4=0x16D0
d11d14as.pid.4=0x0A0C
d11d14as.vid.5=0x16D0
d11d14as.pid.5=0x0856
d11d14as.build.mcu=cortex-m0plus
d11d14as.build.mathlib=arm_cortexM0l_math
d11d14as.build.f_cpu=48000000L
d11d14as.build.usb_product="SAMD11D DevBoard"
d11d14as.build.usb_manufacturer="Wagiminator"
d11d14as.build.board=SAMD_ZERO
d11d14as.build.core=arduino
d11d14as.build.variant=SAMD11D
d11d14as.build.variant_system_lib=
d11d14as.build.vid=0x16D0
d11d14as.upload.protocol=sam-ba
d11d14as.bootloader.tool=arduino:openocd

d11d14as.menu.float.default=Print & String use auto-promoted doubles only
d11d14as.menu.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
d11d14as.menu.float.print=Print uses separate singles and doubles
d11d14as.menu.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
d11d14as.menu.float.string=String uses separate singles and doubles
d11d14as.menu.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
d11d14as.menu.float.both=Print & String use separate singles and doubles
d11d14as.menu.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES

d11d14as.menu.config.disabled=config.h disabled
d11d14as.menu.config.disabled.build.buildconfig=CONFIG_H_DISABLED
d11d14as.menu.config.enabled=config.h enabled (mostly code size reductions)
d11d14as.menu.config.enabled.build.buildconfig=CONFIG_H_ENABLED

d11d14as.menu.clock.internal_usb=Internal USB Calibrated Oscillator
d11d14as.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
d11d14as.menu.clock.internal=Internal Oscillator
d11d14as.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
#d11d14as.menu.clock.crystal_32k=32KHz Crystal
#d11d14as.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
#d11d14as.menu.clock.crystal_hs=High Speed Crystal
#d11d14as.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL

d11d14as.menu.timer.timer_732Hz=732.4Hz (16-bit)
d11d14as.menu.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
d11d14as.menu.timer.timer_366Hz=366.2Hz (16-bit)
d11d14as.menu.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
d11d14as.menu.timer.timer_244Hz=244.1Hz (16-bit)
d11d14as.menu.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
d11d14as.menu.timer.timer_183Hz=183.1Hz (16-bit)
d11d14as.menu.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
d11d14as.menu.timer.timer_146Hz=146.5Hz (16-bit)
d11d14as.menu.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
d11d14as.menu.timer.timer_122Hz=122.1Hz (16-bit)
d11d14as.menu.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
d11d14as.menu.timer.timer_105Hz=104.6Hz (16-bit)
d11d14as.menu.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
d11d14as.menu.timer.timer_81Hz=81.38Hz (16-bit)
d11d14as.menu.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
d11d14as.menu.timer.timer_61Hz=61.04Hz (16-bit)
d11d14as.menu.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
d11d14as.menu.timer.timer_31Hz=30.52Hz (16-bit)
d11d14as.menu.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
d11d14as.menu.timer.timer_187500Hz=187500Hz (8-bit)
d11d14as.menu.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
d11d14as.menu.timer.timer_93750Hz=93750Hz (8-bit)
d11d14as.menu.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
d11d14as.menu.timer.timer_62500Hz=62500Hz (8-bit)
d11d14as.menu.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
d11d14as.menu.timer.timer_37500Hz=37500Hz (8-bit)
d11d14as.menu.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
d11d14as.menu.timer.timer_20833Hz=20833Hz (8-bit)
d11d14as.menu.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
d11d14as.menu.timer.timer_12500Hz=12500Hz (8-bit)
d11d14as.menu.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
d11d14as.menu.timer.timer_7500Hz=7500Hz (8-bit)
d11d14as.menu.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
d11d14as.menu.timer.timer_4166Hz=4166Hz (8-bit)
d11d14as.menu.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
d11d14as.menu.timer.timer_2930Hz=2930Hz (8-bit)
d11d14as.menu.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
d11d14as.menu.timer.timer_1465Hz=1465Hz (8-bit)
d11d14as.menu.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz

d11d14as.build.extra_flags=-D__SAMD11D14AS__ {build.usb_flags} -DARM_MATH_CM0PLUS
d11d14as.build.ldscript=flash_16KB.ld
d11d14as.build.openocdscript=openocd_scripts/SAMD11D14AS.cfg
d11d14as.bootloader.file=sam_ba_SAMD11D_DevBoard_SAMD11D14AS.bin

