wagiminator/SAMD-Development-Boards/ArduinoCore-samd/boards.txt
d21e.menu.cpu.samd21e15b=SAMD21E15B
d21e.menu.cpu.samd21e15b.upload.maximum_size=24576
d21e.menu.cpu.samd21e15b.build.extra_flags=-D__SAMD21E15B__ {build.usb_flags} -DARM_MATH_CM0PLUS
d21e.menu.cpu.samd21e15b.build.ldscript=flash_32KB.ld
d21e.menu.cpu.samd21e15b.build.openocdscript=openocd_scripts/SAMD21E15A.cfg
d21e.menu.cpu.samd21e15b.bootloader.file=sam_ba_SAMD21E_DevBoard_SAMD21E15B.bin

d21e.menu.bootloader.8kb=8KB Bootloader
d21e.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
d21e.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
d21e.menu.bootloader.8kb.upload.tool=SAMD_DevBoards:bossac
d21e.menu.bootloader.8kb.upload.use_1200bps_touch=true
d21e.menu.bootloader.8kb.upload.wait_for_upload_port=true
d21e.menu.bootloader.8kb.upload.native_usb=true

#d21e.menu.bootloader.16kb=16KB Bootloader
#d21e.menu.bootloader.16kb.build.bootloader_size=__16KB_BOOTLOADER__
#d21e.menu.bootloader.16kb.build.ldscript_path=linker_scripts/gcc/16KB_Bootloader
#d21e.menu.bootloader.16kb.upload.tool=SAMD_DevBoards:bossac
#d21e.menu.bootloader.16kb.upload.use_1200bps_touch=true
#d21e.menu.bootloader.16kb.upload.wait_for_upload_port=true
#d21e.menu.bootloader.16kb.upload.native_usb=true

d21e.menu.bootloader.0kb=No Bootloader
d21e.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
d21e.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
d21e.menu.bootloader.0kb.upload.tool=arduino:openocd
d21e.menu.bootloader.0kb.upload.use_1200bps_touch=false
d21e.menu.bootloader.0kb.upload.wait_for_upload_port=false
d21e.menu.bootloader.0kb.upload.native_usb=false

d21e.menu.serial.one_uart=1x UART, 1x WIRE, 1x SPI
d21e.menu.serial.one_uart.build.serialcom_uart=ONE_UART
d21e.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
d21e.menu.serial.one_uart.build.serialcom_spi=ONE_SPI
d21e.menu.serial.one_uart_one_wire_two_spi=1x UART, 1x WIRE, 2x SPI
d21e.menu.serial.one_uart_one_wire_two_spi.build.serialcom_uart=ONE_UART
d21e.menu.serial.one_uart_one_wire_two_spi.build.serialcom_wire=ONE_WIRE
d21e.menu.serial.one_uart_one_wire_two_spi.build.serialcom_spi=TWO_SPI
d21e.menu.serial.one_uart_two_wire_one_spi=1x UART, 2x WIRE, 1x SPI
d21e.menu.serial.one_uart_two_wire_one_spi.build.serialcom_uart=ONE_UART
d21e.menu.serial.one_uart_two_wire_one_spi.build.serialcom_wire=TWO_WIRE
d21e.menu.serial.one_uart_two_wire_one_spi.build.serialcom_spi=ONE_SPI
d21e.menu.serial.two_uart=2x UART, 1x WIRE, 1x SPI
d21e.menu.serial.two_uart.build.serialcom_uart=TWO_UART
d21e.menu.serial.two_uart.build.serialcom_wire=ONE_WIRE
d21e.menu.serial.two_uart.build.serialcom_spi=ONE_SPI
d21e.menu.serial.three_uart_one_wire_no_spi=3x UART, 1x WIRE, 0x SPI
d21e.menu.serial.three_uart_one_wire_no_spi.build.serialcom_uart=THREE_UART
d21e.menu.serial.three_uart_one_wire_no_spi.build.serialcom_wire=ONE_WIRE
d21e.menu.serial.three_uart_one_wire_no_spi.build.serialcom_spi=NO_SPI
d21e.menu.serial.three_uart_no_wire_one_spi=3x UART, 0x WIRE, 1x SPI
d21e.menu.serial.three_uart_no_wire_one_spi.build.serialcom_uart=THREE_UART
d21e.menu.serial.three_uart_no_wire_one_spi.build.serialcom_wire=NO_WIRE
d21e.menu.serial.three_uart_no_wire_one_spi.build.serialcom_spi=ONE_SPI
d21e.menu.serial.four_uart=4x UART, 0x WIRE, 0x SPI
d21e.menu.serial.four_uart.build.serialcom_uart=FOUR_UART
d21e.menu.serial.four_uart.build.serialcom_wire=NO_WIRE
d21e.menu.serial.four_uart.build.serialcom_spi=NO_SPI
d21e.menu.serial.no_uart_one_wire_two_spi=0x UART, 1x WIRE, 2x SPI
d21e.menu.serial.no_uart_one_wire_two_spi.build.serialcom_uart=NO_UART
d21e.menu.serial.no_uart_one_wire_two_spi.build.serialcom_wire=ONE_WIRE
d21e.menu.serial.no_uart_one_wire_two_spi.build.serialcom_spi=TWO_SPI

d21e.menu.usb.cdc=CDC only
d21e.menu.usb.cdc.build.usbcom=CDC_ONLY
d21e.menu.usb.cdc.build.pid=0x0557
d21e.menu.usb.hid=HID only
d21e.menu.usb.hid.build.usbcom=HID_ONLY
d21e.menu.usb.hid.build.pid=0x0B40
d21e.menu.usb.cdc_hid=CDC & HID
d21e.menu.usb.cdc_hid.build.usbcom=CDC_HID
d21e.menu.usb.cdc_hid.build.pid=0x0856
d21e.menu.usb.withcdc=with CDC
d21e.menu.usb.withcdc.build.usbcom=WITH_CDC
d21e.menu.usb.withcdc.build.pid=0x0B41
d21e.menu.usb.nocdc=without CDC
d21e.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
d21e.menu.usb.nocdc.build.pid=0x0A0C
d21e.menu.usb.none=USB disabled
d21e.menu.usb.none.build.usbcom=USB_DISABLED
d21e.menu.usb.none.build.pid=0x0856
